zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_fcfg1.h
// MAC IEEE 802.15.4 Address 0
#define FCFG1_O_MAC_15_4_0                                          0x000002F0

// MAC IEEE 802.15.4 Address 1
#define FCFG1_O_MAC_15_4_1                                          0x000002F4

// Internal
#define FCFG1_O_FLASH_OTP_DATA4                                     0x00000308

// Miscellaneous Trim  Parameters
#define FCFG1_O_MISC_TRIM                                           0x0000030C

// Internal
#define FCFG1_O_RCOSC_HF_TEMPCOMP                                   0x00000310

// IcePick Device Identification
#define FCFG1_O_ICEPICK_DEVICE_ID                                   0x00000318

// Factory Configuration (FCFG1) Revision
#define FCFG1_O_FCFG1_REVISION                                      0x0000031C

// Misc OTP Data
#define FCFG1_O_MISC_OTP_DATA                                       0x00000320

// IO Configuration
#define FCFG1_O_IOCONF                                              0x00000344

// Internal
#define FCFG1_O_CONFIG_IF_ADC                                       0x0000034C

// Internal
#define FCFG1_O_CONFIG_OSC_TOP                                      0x00000350

// AUX_ADC Gain in Absolute Reference Mode
#define FCFG1_O_SOC_ADC_ABS_GAIN                                    0x0000035C

// AUX_ADC Gain in Relative Reference Mode
#define FCFG1_O_SOC_ADC_REL_GAIN                                    0x00000360

// AUX_ADC Temperature Offsets in Absolute Reference Mode
#define FCFG1_O_SOC_ADC_OFFSET_INT                                  0x00000368

// Internal
#define FCFG1_O_SOC_ADC_REF_TRIM_AND_OFFSET_EXT                     0x0000036C

// Internal
#define FCFG1_O_AMPCOMP_TH1                                         0x00000370

// Internal
#define FCFG1_O_AMPCOMP_TH2                                         0x00000374

// Internal
#define FCFG1_O_AMPCOMP_CTRL1                                       0x00000378

// Internal
#define FCFG1_O_ANABYPASS_VALUE2                                    0x0000037C

// Internal
#define FCFG1_O_VOLT_TRIM                                           0x00000388

// OSC Configuration
#define FCFG1_O_OSC_CONF                                            0x0000038C

// Internal
#define FCFG1_O_FREQ_OFFSET                                         0x00000390

// Internal
#define FCFG1_O_MISC_OTP_DATA_1                                     0x00000398

// Shadow of EFUSE:DIE_ID_0 register
#define FCFG1_O_SHDW_DIE_ID_0                                       0x000003D0

// Shadow of EFUSE:DIE_ID_1 register
#define FCFG1_O_SHDW_DIE_ID_1                                       0x000003D4

// Shadow of EFUSE:DIE_ID_2 register
#define FCFG1_O_SHDW_DIE_ID_2                                       0x000003D8

// Shadow of EFUSE:DIE_ID_3 register
#define FCFG1_O_SHDW_DIE_ID_3                                       0x000003DC

// Internal
#define FCFG1_O_SHDW_OSC_BIAS_LDO_TRIM                              0x000003F8

// Internal
#define FCFG1_O_SHDW_ANA_TRIM                                       0x000003FC

// Internal
#define FCFG1_O_DAC_BIAS_CNF                                        0x0000040C

// Internal
#define FCFG1_O_TFW_PROBE                                           0x00000418

// Internal
#define FCFG1_O_TFW_FT                                              0x0000041C

// Internal
#define FCFG1_O_DAC_CAL0                                            0x00000420

// Internal
#define FCFG1_O_DAC_CAL1                                            0x00000424

// Internal
#define FCFG1_O_DAC_CAL2                                            0x00000428

// Internal
#define FCFG1_O_DAC_CAL3                                            0x0000042C

//*****************************************************************************
//
// Register: FCFG1_O_MISC_CONF_1
//
//*****************************************************************************
// Field:   [7:0] DEVICE_MINOR_REV
//
// HW minor revision number (a value of 0xFF shall be treated equally to 0x00).
// Any test of this field by SW should be implemented as a 'greater or equal'
// comparison as signed integer.
// Value may change without warning.
#define FCFG1_MISC_CONF_1_DEVICE_MINOR_REV_W                                 8
#define FCFG1_MISC_CONF_1_DEVICE_MINOR_REV_M                        0x000000FF
#define FCFG1_MISC_CONF_1_DEVICE_MINOR_REV_S                                 0

//*****************************************************************************
//
// Register: FCFG1_O_MISC_CONF_2
//
//*****************************************************************************
// Field:   [7:0] HPOSC_COMP_P3
//
// Internal. Only to be used through TI provided API.
#define FCFG1_MISC_CONF_2_HPOSC_COMP_P3_W                                    8
#define FCFG1_MISC_CONF_2_HPOSC_COMP_P3_M                           0x000000FF
#define FCFG1_MISC_CONF_2_HPOSC_COMP_P3_S                                    0

//*****************************************************************************
//
// Register: FCFG1_O_HPOSC_MEAS_5
//
//*****************************************************************************
// Field: [31:16] HPOSC_D5
//
// Internal. Only to be used through TI provided API.
#define FCFG1_HPOSC_MEAS_5_HPOSC_D5_W                                       16
#define FCFG1_HPOSC_MEAS_5_HPOSC_D5_M                               0xFFFF0000
#define FCFG1_HPOSC_MEAS_5_HPOSC_D5_S                                       16

// Field:  [15:8] HPOSC_T5
//
// Internal. Only to be used through TI provided API.
#define FCFG1_HPOSC_MEAS_5_HPOSC_T5_W                                        8
#define FCFG1_HPOSC_MEAS_5_HPOSC_T5_M                               0x0000FF00
#define FCFG1_HPOSC_MEAS_5_HPOSC_T5_S                                        8

// Field:   [7:0] HPOSC_DT5
//
// Internal. Only to be used through TI provided API.
#define FCFG1_HPOSC_MEAS_5_HPOSC_DT5_W                                       8
#define FCFG1_HPOSC_MEAS_5_HPOSC_DT5_M                              0x000000FF
#define FCFG1_HPOSC_MEAS_5_HPOSC_DT5_S                                       0

//*****************************************************************************
//
// Register: FCFG1_O_HPOSC_MEAS_4
//
//*****************************************************************************
// Field: [31:16] HPOSC_D4
//
// Internal. Only to be used through TI provided API.
#define FCFG1_HPOSC_MEAS_4_HPOSC_D4_W                                       16
#define FCFG1_HPOSC_MEAS_4_HPOSC_D4_M                               0xFFFF0000
#define FCFG1_HPOSC_MEAS_4_HPOSC_D4_S                                       16

// Field:  [15:8] HPOSC_T4
//
// Internal. Only to be used through TI provided API.
#define FCFG1_HPOSC_MEAS_4_HPOSC_T4_W                                        8
#define FCFG1_HPOSC_MEAS_4_HPOSC_T4_M                               0x0000FF00
#define FCFG1_HPOSC_MEAS_4_HPOSC_T4_S                                        8

// Field:   [7:0] HPOSC_DT4
//
// Internal. Only to be used through TI provided API.
#define FCFG1_HPOSC_MEAS_4_HPOSC_DT4_W                                       8
#define FCFG1_HPOSC_MEAS_4_HPOSC_DT4_M                              0x000000FF
#define FCFG1_HPOSC_MEAS_4_HPOSC_DT4_S                                       0

//*****************************************************************************
//
// Register: FCFG1_O_HPOSC_MEAS_3
//
//*****************************************************************************
// Field: [31:16] HPOSC_D3
//
// Internal. Only to be used through TI provided API.
#define FCFG1_HPOSC_MEAS_3_HPOSC_D3_W                                       16
#define FCFG1_HPOSC_MEAS_3_HPOSC_D3_M                               0xFFFF0000
#define FCFG1_HPOSC_MEAS_3_HPOSC_D3_S                                       16

// Field:  [15:8] HPOSC_T3
//
// Internal. Only to be used through TI provided API.
#define FCFG1_HPOSC_MEAS_3_HPOSC_T3_W                                        8
#define FCFG1_HPOSC_MEAS_3_HPOSC_T3_M                               0x0000FF00
#define FCFG1_HPOSC_MEAS_3_HPOSC_T3_S                                        8

// Field:   [7:0] HPOSC_DT3
//
// Internal. Only to be used through TI provided API.
#define FCFG1_HPOSC_MEAS_3_HPOSC_DT3_W                                       8
#define FCFG1_HPOSC_MEAS_3_HPOSC_DT3_M                              0x000000FF
#define FCFG1_HPOSC_MEAS_3_HPOSC_DT3_S                                       0

//*****************************************************************************
//
// Register: FCFG1_O_HPOSC_MEAS_2
//
//*****************************************************************************
// Field: [31:16] HPOSC_D2
//
// Internal. Only to be used through TI provided API.
#define FCFG1_HPOSC_MEAS_2_HPOSC_D2_W                                       16
#define FCFG1_HPOSC_MEAS_2_HPOSC_D2_M                               0xFFFF0000
#define FCFG1_HPOSC_MEAS_2_HPOSC_D2_S                                       16

