zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_fcfg1.h
// Field:  [11:6] LDOVCO_TRIM_OUTPUT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_1G_LDOVCO_TRIM_OUTPUT_W                 6
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_1G_LDOVCO_TRIM_OUTPUT_M        0x00000FC0
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_1G_LDOVCO_TRIM_OUTPUT_S                 6

// Field:     [5] RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_1G_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N \
                                                                    0x00000020
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_1G_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_BITN \
                                                                             5
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_1G_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_M \
                                                                    0x00000020
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_1G_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_S \
                                                                             5

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_SYNTH_DIV2_CC13_1G
//
//*****************************************************************************
// Field: [31:28] MIN_ALLOWED_RTRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_MIN_ALLOWED_RTRIM_W                  4
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_MIN_ALLOWED_RTRIM_M         0xF0000000
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_MIN_ALLOWED_RTRIM_S                 28

// Field: [27:12] RFC_MDM_DEMIQMC0
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_RFC_MDM_DEMIQMC0_W                  16
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_RFC_MDM_DEMIQMC0_M          0x0FFFF000
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_RFC_MDM_DEMIQMC0_S                  12

// Field:  [11:6] LDOVCO_TRIM_OUTPUT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_LDOVCO_TRIM_OUTPUT_W                 6
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_LDOVCO_TRIM_OUTPUT_M        0x00000FC0
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_LDOVCO_TRIM_OUTPUT_S                 6

// Field:     [5] RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N \
                                                                    0x00000020
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_BITN \
                                                                             5
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_M \
                                                                    0x00000020
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_S \
                                                                             5

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_SYNTH_DIV4_CC26
//
//*****************************************************************************
// Field: [31:28] MIN_ALLOWED_RTRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV4_CC26_MIN_ALLOWED_RTRIM_W                     4
#define FCFG1_CONFIG_SYNTH_DIV4_CC26_MIN_ALLOWED_RTRIM_M            0xF0000000
#define FCFG1_CONFIG_SYNTH_DIV4_CC26_MIN_ALLOWED_RTRIM_S                    28

// Field: [27:12] RFC_MDM_DEMIQMC0
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV4_CC26_RFC_MDM_DEMIQMC0_W                     16
#define FCFG1_CONFIG_SYNTH_DIV4_CC26_RFC_MDM_DEMIQMC0_M             0x0FFFF000
#define FCFG1_CONFIG_SYNTH_DIV4_CC26_RFC_MDM_DEMIQMC0_S                     12

// Field:  [11:6] LDOVCO_TRIM_OUTPUT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV4_CC26_LDOVCO_TRIM_OUTPUT_W                    6
#define FCFG1_CONFIG_SYNTH_DIV4_CC26_LDOVCO_TRIM_OUTPUT_M           0x00000FC0
#define FCFG1_CONFIG_SYNTH_DIV4_CC26_LDOVCO_TRIM_OUTPUT_S                    6

// Field:     [5] RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV4_CC26_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N \
                                                                    0x00000020
#define FCFG1_CONFIG_SYNTH_DIV4_CC26_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_BITN \
                                                                             5
#define FCFG1_CONFIG_SYNTH_DIV4_CC26_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_M \
                                                                    0x00000020
#define FCFG1_CONFIG_SYNTH_DIV4_CC26_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_S \
                                                                             5

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_SYNTH_DIV4_CC13
//
//*****************************************************************************
// Field: [31:28] MIN_ALLOWED_RTRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV4_CC13_MIN_ALLOWED_RTRIM_W                     4
#define FCFG1_CONFIG_SYNTH_DIV4_CC13_MIN_ALLOWED_RTRIM_M            0xF0000000
#define FCFG1_CONFIG_SYNTH_DIV4_CC13_MIN_ALLOWED_RTRIM_S                    28

// Field: [27:12] RFC_MDM_DEMIQMC0
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV4_CC13_RFC_MDM_DEMIQMC0_W                     16
#define FCFG1_CONFIG_SYNTH_DIV4_CC13_RFC_MDM_DEMIQMC0_M             0x0FFFF000
#define FCFG1_CONFIG_SYNTH_DIV4_CC13_RFC_MDM_DEMIQMC0_S                     12

// Field:  [11:6] LDOVCO_TRIM_OUTPUT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV4_CC13_LDOVCO_TRIM_OUTPUT_W                    6
#define FCFG1_CONFIG_SYNTH_DIV4_CC13_LDOVCO_TRIM_OUTPUT_M           0x00000FC0
#define FCFG1_CONFIG_SYNTH_DIV4_CC13_LDOVCO_TRIM_OUTPUT_S                    6

// Field:     [5] RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV4_CC13_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N \
                                                                    0x00000020
#define FCFG1_CONFIG_SYNTH_DIV4_CC13_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_BITN \
                                                                             5
#define FCFG1_CONFIG_SYNTH_DIV4_CC13_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_M \
                                                                    0x00000020
#define FCFG1_CONFIG_SYNTH_DIV4_CC13_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_S \
                                                                             5

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_SYNTH_DIV5
//
//*****************************************************************************
// Field: [31:28] MIN_ALLOWED_RTRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV5_MIN_ALLOWED_RTRIM_W                          4
#define FCFG1_CONFIG_SYNTH_DIV5_MIN_ALLOWED_RTRIM_M                 0xF0000000
#define FCFG1_CONFIG_SYNTH_DIV5_MIN_ALLOWED_RTRIM_S                         28

// Field: [27:12] RFC_MDM_DEMIQMC0
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV5_RFC_MDM_DEMIQMC0_W                          16
#define FCFG1_CONFIG_SYNTH_DIV5_RFC_MDM_DEMIQMC0_M                  0x0FFFF000
#define FCFG1_CONFIG_SYNTH_DIV5_RFC_MDM_DEMIQMC0_S                          12

