zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_fcfg1.h
// Field:  [11:6] LDOVCO_TRIM_OUTPUT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV12_CC26_LDOVCO_TRIM_OUTPUT_W                   6
#define FCFG1_CONFIG_SYNTH_DIV12_CC26_LDOVCO_TRIM_OUTPUT_M          0x00000FC0
#define FCFG1_CONFIG_SYNTH_DIV12_CC26_LDOVCO_TRIM_OUTPUT_S                   6

// Field:     [5] RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV12_CC26_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N \
                                                                    0x00000020
#define FCFG1_CONFIG_SYNTH_DIV12_CC26_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_BITN \
                                                                             5
#define FCFG1_CONFIG_SYNTH_DIV12_CC26_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_M \
                                                                    0x00000020
#define FCFG1_CONFIG_SYNTH_DIV12_CC26_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_S \
                                                                             5

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_SYNTH_DIV12_CC13
//
//*****************************************************************************
// Field: [31:28] MIN_ALLOWED_RTRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV12_CC13_MIN_ALLOWED_RTRIM_W                    4
#define FCFG1_CONFIG_SYNTH_DIV12_CC13_MIN_ALLOWED_RTRIM_M           0xF0000000
#define FCFG1_CONFIG_SYNTH_DIV12_CC13_MIN_ALLOWED_RTRIM_S                   28

// Field: [27:12] RFC_MDM_DEMIQMC0
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV12_CC13_RFC_MDM_DEMIQMC0_W                    16
#define FCFG1_CONFIG_SYNTH_DIV12_CC13_RFC_MDM_DEMIQMC0_M            0x0FFFF000
#define FCFG1_CONFIG_SYNTH_DIV12_CC13_RFC_MDM_DEMIQMC0_S                    12

// Field:  [11:6] LDOVCO_TRIM_OUTPUT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV12_CC13_LDOVCO_TRIM_OUTPUT_W                   6
#define FCFG1_CONFIG_SYNTH_DIV12_CC13_LDOVCO_TRIM_OUTPUT_M          0x00000FC0
#define FCFG1_CONFIG_SYNTH_DIV12_CC13_LDOVCO_TRIM_OUTPUT_S                   6

// Field:     [5] RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV12_CC13_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N \
                                                                    0x00000020
#define FCFG1_CONFIG_SYNTH_DIV12_CC13_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_BITN \
                                                                             5
#define FCFG1_CONFIG_SYNTH_DIV12_CC13_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_M \
                                                                    0x00000020
#define FCFG1_CONFIG_SYNTH_DIV12_CC13_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_S \
                                                                             5

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_SYNTH_DIV15
//
//*****************************************************************************
// Field: [31:28] MIN_ALLOWED_RTRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV15_MIN_ALLOWED_RTRIM_W                         4
#define FCFG1_CONFIG_SYNTH_DIV15_MIN_ALLOWED_RTRIM_M                0xF0000000
#define FCFG1_CONFIG_SYNTH_DIV15_MIN_ALLOWED_RTRIM_S                        28

// Field: [27:12] RFC_MDM_DEMIQMC0
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV15_RFC_MDM_DEMIQMC0_W                         16
#define FCFG1_CONFIG_SYNTH_DIV15_RFC_MDM_DEMIQMC0_M                 0x0FFFF000
#define FCFG1_CONFIG_SYNTH_DIV15_RFC_MDM_DEMIQMC0_S                         12

// Field:  [11:6] LDOVCO_TRIM_OUTPUT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV15_LDOVCO_TRIM_OUTPUT_W                        6
#define FCFG1_CONFIG_SYNTH_DIV15_LDOVCO_TRIM_OUTPUT_M               0x00000FC0
#define FCFG1_CONFIG_SYNTH_DIV15_LDOVCO_TRIM_OUTPUT_S                        6

// Field:     [5] RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV15_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N     \
                                                                    0x00000020
#define FCFG1_CONFIG_SYNTH_DIV15_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_BITN \
                                                                             5
#define FCFG1_CONFIG_SYNTH_DIV15_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_M   \
                                                                    0x00000020
#define FCFG1_CONFIG_SYNTH_DIV15_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_S   \
                                                                             5

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_SYNTH_DIV30
//
//*****************************************************************************
// Field: [31:28] MIN_ALLOWED_RTRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV30_MIN_ALLOWED_RTRIM_W                         4
#define FCFG1_CONFIG_SYNTH_DIV30_MIN_ALLOWED_RTRIM_M                0xF0000000
#define FCFG1_CONFIG_SYNTH_DIV30_MIN_ALLOWED_RTRIM_S                        28

// Field: [27:12] RFC_MDM_DEMIQMC0
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV30_RFC_MDM_DEMIQMC0_W                         16
#define FCFG1_CONFIG_SYNTH_DIV30_RFC_MDM_DEMIQMC0_M                 0x0FFFF000
#define FCFG1_CONFIG_SYNTH_DIV30_RFC_MDM_DEMIQMC0_S                         12

// Field:  [11:6] LDOVCO_TRIM_OUTPUT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV30_LDOVCO_TRIM_OUTPUT_W                        6
#define FCFG1_CONFIG_SYNTH_DIV30_LDOVCO_TRIM_OUTPUT_M               0x00000FC0
#define FCFG1_CONFIG_SYNTH_DIV30_LDOVCO_TRIM_OUTPUT_S                        6

// Field:     [5] RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV30_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N     \
                                                                    0x00000020
#define FCFG1_CONFIG_SYNTH_DIV30_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_BITN \
                                                                             5
#define FCFG1_CONFIG_SYNTH_DIV30_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_M   \
                                                                    0x00000020
#define FCFG1_CONFIG_SYNTH_DIV30_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_S   \
                                                                             5

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_NUMBER
//
//*****************************************************************************
// Field:  [31:0] LOT_NUMBER
//
// Number of the manufacturing lot that produced this unit.
#define FCFG1_FLASH_NUMBER_LOT_NUMBER_W                                     32
#define FCFG1_FLASH_NUMBER_LOT_NUMBER_M                             0xFFFFFFFF
#define FCFG1_FLASH_NUMBER_LOT_NUMBER_S                                      0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_COORDINATE
//
//*****************************************************************************
// Field: [31:16] XCOORDINATE
//
// X coordinate of this unit on the wafer.
#define FCFG1_FLASH_COORDINATE_XCOORDINATE_W                                16
#define FCFG1_FLASH_COORDINATE_XCOORDINATE_M                        0xFFFF0000
#define FCFG1_FLASH_COORDINATE_XCOORDINATE_S                                16

// Field:  [15:0] YCOORDINATE
//
// Y coordinate of this unit on the wafer.
#define FCFG1_FLASH_COORDINATE_YCOORDINATE_W                                16
#define FCFG1_FLASH_COORDINATE_YCOORDINATE_M                        0x0000FFFF
#define FCFG1_FLASH_COORDINATE_YCOORDINATE_S                                 0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_E_P
//
//*****************************************************************************
// Field: [31:24] PSU
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_E_P_PSU_W                                                8
#define FCFG1_FLASH_E_P_PSU_M                                       0xFF000000
#define FCFG1_FLASH_E_P_PSU_S                                               24

// Field: [23:16] ESU
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_E_P_ESU_W                                                8
#define FCFG1_FLASH_E_P_ESU_M                                       0x00FF0000
#define FCFG1_FLASH_E_P_ESU_S                                               16

// Field:  [15:8] PVSU
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_E_P_PVSU_W                                               8
#define FCFG1_FLASH_E_P_PVSU_M                                      0x0000FF00
#define FCFG1_FLASH_E_P_PVSU_S                                               8

// Field:   [7:0] EVSU
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_E_P_EVSU_W                                               8
#define FCFG1_FLASH_E_P_EVSU_M                                      0x000000FF
#define FCFG1_FLASH_E_P_EVSU_S                                               0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_C_E_P_R
//
//*****************************************************************************
// Field: [31:24] RVSU
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_C_E_P_R_RVSU_W                                           8
#define FCFG1_FLASH_C_E_P_R_RVSU_M                                  0xFF000000
#define FCFG1_FLASH_C_E_P_R_RVSU_S                                          24

// Field: [23:16] PV_ACCESS
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_C_E_P_R_PV_ACCESS_W                                      8
#define FCFG1_FLASH_C_E_P_R_PV_ACCESS_M                             0x00FF0000
#define FCFG1_FLASH_C_E_P_R_PV_ACCESS_S                                     16

// Field: [15:12] A_EXEZ_SETUP
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_C_E_P_R_A_EXEZ_SETUP_W                                   4
#define FCFG1_FLASH_C_E_P_R_A_EXEZ_SETUP_M                          0x0000F000
#define FCFG1_FLASH_C_E_P_R_A_EXEZ_SETUP_S                                  12

// Field:  [11:0] CVSU
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_C_E_P_R_CVSU_W                                          12
#define FCFG1_FLASH_C_E_P_R_CVSU_M                                  0x00000FFF
#define FCFG1_FLASH_C_E_P_R_CVSU_S                                           0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_P_R_PV
//
//*****************************************************************************
// Field: [31:24] PH
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_P_R_PV_PH_W                                              8
#define FCFG1_FLASH_P_R_PV_PH_M                                     0xFF000000
#define FCFG1_FLASH_P_R_PV_PH_S                                             24

// Field: [23:16] RH
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_P_R_PV_RH_W                                              8
#define FCFG1_FLASH_P_R_PV_RH_M                                     0x00FF0000
#define FCFG1_FLASH_P_R_PV_RH_S                                             16

