zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_fcfg1.h
// Field: [20:19] XOSC_HF_FAST_START
//
// Trim value for DDI_0_OSC:CTL1.XOSC_HF_FAST_START.
#define FCFG1_OSC_CONF_XOSC_HF_FAST_START_W                                  2
#define FCFG1_OSC_CONF_XOSC_HF_FAST_START_M                         0x00180000
#define FCFG1_OSC_CONF_XOSC_HF_FAST_START_S                                 19

// Field:    [18] XOSC_OPTION
//
// 0: XOSC_HF unavailable (may not be bonded out)
// 1: XOSC_HF available (default)
#define FCFG1_OSC_CONF_XOSC_OPTION                                  0x00040000
#define FCFG1_OSC_CONF_XOSC_OPTION_BITN                                     18
#define FCFG1_OSC_CONF_XOSC_OPTION_M                                0x00040000
#define FCFG1_OSC_CONF_XOSC_OPTION_S                                        18

// Field:    [17] HPOSC_OPTION
//
// Internal. Only to be used through TI provided API.
#define FCFG1_OSC_CONF_HPOSC_OPTION                                 0x00020000
#define FCFG1_OSC_CONF_HPOSC_OPTION_BITN                                    17
#define FCFG1_OSC_CONF_HPOSC_OPTION_M                               0x00020000
#define FCFG1_OSC_CONF_HPOSC_OPTION_S                                       17

// Field:    [16] HPOSC_BIAS_HOLD_MODE_EN
//
// Internal. Only to be used through TI provided API.
#define FCFG1_OSC_CONF_HPOSC_BIAS_HOLD_MODE_EN                      0x00010000
#define FCFG1_OSC_CONF_HPOSC_BIAS_HOLD_MODE_EN_BITN                         16
#define FCFG1_OSC_CONF_HPOSC_BIAS_HOLD_MODE_EN_M                    0x00010000
#define FCFG1_OSC_CONF_HPOSC_BIAS_HOLD_MODE_EN_S                            16

// Field: [15:12] HPOSC_CURRMIRR_RATIO
//
// Internal. Only to be used through TI provided API.
#define FCFG1_OSC_CONF_HPOSC_CURRMIRR_RATIO_W                                4
#define FCFG1_OSC_CONF_HPOSC_CURRMIRR_RATIO_M                       0x0000F000
#define FCFG1_OSC_CONF_HPOSC_CURRMIRR_RATIO_S                               12

// Field:  [11:8] HPOSC_BIAS_RES_SET
//
// Internal. Only to be used through TI provided API.
#define FCFG1_OSC_CONF_HPOSC_BIAS_RES_SET_W                                  4
#define FCFG1_OSC_CONF_HPOSC_BIAS_RES_SET_M                         0x00000F00
#define FCFG1_OSC_CONF_HPOSC_BIAS_RES_SET_S                                  8

// Field:     [7] HPOSC_FILTER_EN
//
// Internal. Only to be used through TI provided API.
#define FCFG1_OSC_CONF_HPOSC_FILTER_EN                              0x00000080
#define FCFG1_OSC_CONF_HPOSC_FILTER_EN_BITN                                  7
#define FCFG1_OSC_CONF_HPOSC_FILTER_EN_M                            0x00000080
#define FCFG1_OSC_CONF_HPOSC_FILTER_EN_S                                     7

// Field:   [6:5] HPOSC_BIAS_RECHARGE_DELAY
//
// Internal. Only to be used through TI provided API.
#define FCFG1_OSC_CONF_HPOSC_BIAS_RECHARGE_DELAY_W                           2
#define FCFG1_OSC_CONF_HPOSC_BIAS_RECHARGE_DELAY_M                  0x00000060
#define FCFG1_OSC_CONF_HPOSC_BIAS_RECHARGE_DELAY_S                           5

// Field:   [2:1] HPOSC_SERIES_CAP
//
// Internal. Only to be used through TI provided API.
#define FCFG1_OSC_CONF_HPOSC_SERIES_CAP_W                                    2
#define FCFG1_OSC_CONF_HPOSC_SERIES_CAP_M                           0x00000006
#define FCFG1_OSC_CONF_HPOSC_SERIES_CAP_S                                    1

// Field:     [0] HPOSC_DIV3_BYPASS
//
// Internal. Only to be used through TI provided API.
#define FCFG1_OSC_CONF_HPOSC_DIV3_BYPASS                            0x00000001
#define FCFG1_OSC_CONF_HPOSC_DIV3_BYPASS_BITN                                0
#define FCFG1_OSC_CONF_HPOSC_DIV3_BYPASS_M                          0x00000001
#define FCFG1_OSC_CONF_HPOSC_DIV3_BYPASS_S                                   0

//*****************************************************************************
//
// Register: FCFG1_O_FREQ_OFFSET
//
//*****************************************************************************
// Field: [31:16] HPOSC_COMP_P0
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FREQ_OFFSET_HPOSC_COMP_P0_W                                   16
#define FCFG1_FREQ_OFFSET_HPOSC_COMP_P0_M                           0xFFFF0000
#define FCFG1_FREQ_OFFSET_HPOSC_COMP_P0_S                                   16

// Field:  [15:8] HPOSC_COMP_P1
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FREQ_OFFSET_HPOSC_COMP_P1_W                                    8
#define FCFG1_FREQ_OFFSET_HPOSC_COMP_P1_M                           0x0000FF00
#define FCFG1_FREQ_OFFSET_HPOSC_COMP_P1_S                                    8

// Field:   [7:0] HPOSC_COMP_P2
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FREQ_OFFSET_HPOSC_COMP_P2_W                                    8
#define FCFG1_FREQ_OFFSET_HPOSC_COMP_P2_M                           0x000000FF
#define FCFG1_FREQ_OFFSET_HPOSC_COMP_P2_S                                    0

//*****************************************************************************
//
// Register: FCFG1_O_MISC_OTP_DATA_1
//
//*****************************************************************************
// Field: [28:27] PEAK_DET_ITRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_MISC_OTP_DATA_1_PEAK_DET_ITRIM_W                               2
#define FCFG1_MISC_OTP_DATA_1_PEAK_DET_ITRIM_M                      0x18000000
#define FCFG1_MISC_OTP_DATA_1_PEAK_DET_ITRIM_S                              27

// Field: [26:24] HP_BUF_ITRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_MISC_OTP_DATA_1_HP_BUF_ITRIM_W                                 3
#define FCFG1_MISC_OTP_DATA_1_HP_BUF_ITRIM_M                        0x07000000
#define FCFG1_MISC_OTP_DATA_1_HP_BUF_ITRIM_S                                24

// Field: [23:22] LP_BUF_ITRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_MISC_OTP_DATA_1_LP_BUF_ITRIM_W                                 2
#define FCFG1_MISC_OTP_DATA_1_LP_BUF_ITRIM_M                        0x00C00000
#define FCFG1_MISC_OTP_DATA_1_LP_BUF_ITRIM_S                                22

