zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_fcfg1.h
// Field: [28:27] BOD_BANDGAP_TRIM_CNF_EXT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_SHDW_ANA_TRIM_BOD_BANDGAP_TRIM_CNF_EXT_W                       2
#define FCFG1_SHDW_ANA_TRIM_BOD_BANDGAP_TRIM_CNF_EXT_M              0x18000000
#define FCFG1_SHDW_ANA_TRIM_BOD_BANDGAP_TRIM_CNF_EXT_S                      27

// Field: [26:25] BOD_BANDGAP_TRIM_CNF
//
// Internal. Only to be used through TI provided API.
#define FCFG1_SHDW_ANA_TRIM_BOD_BANDGAP_TRIM_CNF_W                           2
#define FCFG1_SHDW_ANA_TRIM_BOD_BANDGAP_TRIM_CNF_M                  0x06000000
#define FCFG1_SHDW_ANA_TRIM_BOD_BANDGAP_TRIM_CNF_S                          25

// Field:    [24] VDDR_ENABLE_PG1
//
// Internal. Only to be used through TI provided API.
#define FCFG1_SHDW_ANA_TRIM_VDDR_ENABLE_PG1                         0x01000000
#define FCFG1_SHDW_ANA_TRIM_VDDR_ENABLE_PG1_BITN                            24
#define FCFG1_SHDW_ANA_TRIM_VDDR_ENABLE_PG1_M                       0x01000000
#define FCFG1_SHDW_ANA_TRIM_VDDR_ENABLE_PG1_S                               24

// Field:    [23] VDDR_OK_HYS
//
// Internal. Only to be used through TI provided API.
#define FCFG1_SHDW_ANA_TRIM_VDDR_OK_HYS                             0x00800000
#define FCFG1_SHDW_ANA_TRIM_VDDR_OK_HYS_BITN                                23
#define FCFG1_SHDW_ANA_TRIM_VDDR_OK_HYS_M                           0x00800000
#define FCFG1_SHDW_ANA_TRIM_VDDR_OK_HYS_S                                   23

// Field: [22:21] IPTAT_TRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_SHDW_ANA_TRIM_IPTAT_TRIM_W                                     2
#define FCFG1_SHDW_ANA_TRIM_IPTAT_TRIM_M                            0x00600000
#define FCFG1_SHDW_ANA_TRIM_IPTAT_TRIM_S                                    21

// Field: [20:16] VDDR_TRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_SHDW_ANA_TRIM_VDDR_TRIM_W                                      5
#define FCFG1_SHDW_ANA_TRIM_VDDR_TRIM_M                             0x001F0000
#define FCFG1_SHDW_ANA_TRIM_VDDR_TRIM_S                                     16

// Field: [15:11] TRIMBOD_INTMODE
//
// Internal. Only to be used through TI provided API.
#define FCFG1_SHDW_ANA_TRIM_TRIMBOD_INTMODE_W                                5
#define FCFG1_SHDW_ANA_TRIM_TRIMBOD_INTMODE_M                       0x0000F800
#define FCFG1_SHDW_ANA_TRIM_TRIMBOD_INTMODE_S                               11

// Field:  [10:6] TRIMBOD_EXTMODE
//
// Internal. Only to be used through TI provided API.
#define FCFG1_SHDW_ANA_TRIM_TRIMBOD_EXTMODE_W                                5
#define FCFG1_SHDW_ANA_TRIM_TRIMBOD_EXTMODE_M                       0x000007C0
#define FCFG1_SHDW_ANA_TRIM_TRIMBOD_EXTMODE_S                                6

// Field:   [5:0] TRIMTEMP
//
// Internal. Only to be used through TI provided API.
#define FCFG1_SHDW_ANA_TRIM_TRIMTEMP_W                                       6
#define FCFG1_SHDW_ANA_TRIM_TRIMTEMP_M                              0x0000003F
#define FCFG1_SHDW_ANA_TRIM_TRIMTEMP_S                                       0

//*****************************************************************************
//
// Register: FCFG1_O_DAC_BIAS_CNF
//
//*****************************************************************************
// Field: [17:12] LPM_TRIM_IOUT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_DAC_BIAS_CNF_LPM_TRIM_IOUT_W                                   6
#define FCFG1_DAC_BIAS_CNF_LPM_TRIM_IOUT_M                          0x0003F000
#define FCFG1_DAC_BIAS_CNF_LPM_TRIM_IOUT_S                                  12

// Field:  [11:9] LPM_BIAS_WIDTH_TRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_DAC_BIAS_CNF_LPM_BIAS_WIDTH_TRIM_W                             3
#define FCFG1_DAC_BIAS_CNF_LPM_BIAS_WIDTH_TRIM_M                    0x00000E00
#define FCFG1_DAC_BIAS_CNF_LPM_BIAS_WIDTH_TRIM_S                             9

// Field:     [8] LPM_BIAS_BACKUP_EN
//
// Internal. Only to be used through TI provided API.
#define FCFG1_DAC_BIAS_CNF_LPM_BIAS_BACKUP_EN                       0x00000100
#define FCFG1_DAC_BIAS_CNF_LPM_BIAS_BACKUP_EN_BITN                           8
#define FCFG1_DAC_BIAS_CNF_LPM_BIAS_BACKUP_EN_M                     0x00000100
#define FCFG1_DAC_BIAS_CNF_LPM_BIAS_BACKUP_EN_S                              8

//*****************************************************************************
//
// Register: FCFG1_O_TFW_PROBE
//
//*****************************************************************************
// Field:  [31:0] REV
//
// Internal. Only to be used through TI provided API.
#define FCFG1_TFW_PROBE_REV_W                                               32
#define FCFG1_TFW_PROBE_REV_M                                       0xFFFFFFFF
#define FCFG1_TFW_PROBE_REV_S                                                0

//*****************************************************************************
//
// Register: FCFG1_O_TFW_FT
//
//*****************************************************************************
// Field:  [31:0] REV
//
// Internal. Only to be used through TI provided API.
#define FCFG1_TFW_FT_REV_W                                                  32
#define FCFG1_TFW_FT_REV_M                                          0xFFFFFFFF
#define FCFG1_TFW_FT_REV_S                                                   0

//*****************************************************************************
//
// Register: FCFG1_O_DAC_CAL0
//
//*****************************************************************************
// Field: [31:16] SOC_DAC_VOUT_CAL_DECOUPLE_C2
//
// Internal. Only to be used through TI provided API.
#define FCFG1_DAC_CAL0_SOC_DAC_VOUT_CAL_DECOUPLE_C2_W                       16
#define FCFG1_DAC_CAL0_SOC_DAC_VOUT_CAL_DECOUPLE_C2_M               0xFFFF0000
#define FCFG1_DAC_CAL0_SOC_DAC_VOUT_CAL_DECOUPLE_C2_S                       16

// Field:  [15:0] SOC_DAC_VOUT_CAL_DECOUPLE_C1
//
// Internal. Only to be used through TI provided API.
#define FCFG1_DAC_CAL0_SOC_DAC_VOUT_CAL_DECOUPLE_C1_W                       16
#define FCFG1_DAC_CAL0_SOC_DAC_VOUT_CAL_DECOUPLE_C1_M               0x0000FFFF
#define FCFG1_DAC_CAL0_SOC_DAC_VOUT_CAL_DECOUPLE_C1_S                        0

//*****************************************************************************
//
// Register: FCFG1_O_DAC_CAL1
//
//*****************************************************************************
// Field: [31:16] SOC_DAC_VOUT_CAL_PRECH_C2
//
// Internal. Only to be used through TI provided API.
#define FCFG1_DAC_CAL1_SOC_DAC_VOUT_CAL_PRECH_C2_W                          16
#define FCFG1_DAC_CAL1_SOC_DAC_VOUT_CAL_PRECH_C2_M                  0xFFFF0000
#define FCFG1_DAC_CAL1_SOC_DAC_VOUT_CAL_PRECH_C2_S                          16

// Field:  [15:0] SOC_DAC_VOUT_CAL_PRECH_C1
//
// Internal. Only to be used through TI provided API.
#define FCFG1_DAC_CAL1_SOC_DAC_VOUT_CAL_PRECH_C1_W                          16
#define FCFG1_DAC_CAL1_SOC_DAC_VOUT_CAL_PRECH_C1_M                  0x0000FFFF
#define FCFG1_DAC_CAL1_SOC_DAC_VOUT_CAL_PRECH_C1_S                           0

//*****************************************************************************
//
// Register: FCFG1_O_DAC_CAL2
//
//*****************************************************************************
// Field: [31:16] SOC_DAC_VOUT_CAL_ADCREF_C2
//
// Internal. Only to be used through TI provided API.
#define FCFG1_DAC_CAL2_SOC_DAC_VOUT_CAL_ADCREF_C2_W                         16
#define FCFG1_DAC_CAL2_SOC_DAC_VOUT_CAL_ADCREF_C2_M                 0xFFFF0000
#define FCFG1_DAC_CAL2_SOC_DAC_VOUT_CAL_ADCREF_C2_S                         16

// Field:  [15:0] SOC_DAC_VOUT_CAL_ADCREF_C1
//
// Internal. Only to be used through TI provided API.
#define FCFG1_DAC_CAL2_SOC_DAC_VOUT_CAL_ADCREF_C1_W                         16
#define FCFG1_DAC_CAL2_SOC_DAC_VOUT_CAL_ADCREF_C1_M                 0x0000FFFF
#define FCFG1_DAC_CAL2_SOC_DAC_VOUT_CAL_ADCREF_C1_S                          0

//*****************************************************************************
//
// Register: FCFG1_O_DAC_CAL3
//
//*****************************************************************************
// Field: [31:16] SOC_DAC_VOUT_CAL_VDDS_C2
//
// Internal. Only to be used through TI provided API.
#define FCFG1_DAC_CAL3_SOC_DAC_VOUT_CAL_VDDS_C2_W                           16
#define FCFG1_DAC_CAL3_SOC_DAC_VOUT_CAL_VDDS_C2_M                   0xFFFF0000
#define FCFG1_DAC_CAL3_SOC_DAC_VOUT_CAL_VDDS_C2_S                           16

// Field:  [15:0] SOC_DAC_VOUT_CAL_VDDS_C1
//
// Internal. Only to be used through TI provided API.
#define FCFG1_DAC_CAL3_SOC_DAC_VOUT_CAL_VDDS_C1_W                           16
#define FCFG1_DAC_CAL3_SOC_DAC_VOUT_CAL_VDDS_C1_M                   0x0000FFFF
#define FCFG1_DAC_CAL3_SOC_DAC_VOUT_CAL_VDDS_C1_S                            0


#endif // __FCFG1__
